
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 4 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.redis_connection_string
  * module.redis-cache.azurerm_resource_group.cache-resourcegroup[0]
* Delete
  * module.frontend.azurerm_resource_group.rg
  * module.frontend.azurerm_template_deployment.tmprofile[0]
  * module.frontend.null_resource.azcli_exec[0]
* Replace
  * module.redis-cache.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_connection_string" {
        id                      = "https://div-aat.vault.azure.net/secrets/rfe-redis-connection-string/27dd2a8e319248088aa5512ef38406f1"
        name                    = "rfe-redis-connection-string"
      ~ tags                    = {
          - "file-encoding" = "utf-8" -> null
        }
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.frontend.azurerm_resource_group.rg will be destroyed
  # (because azurerm_resource_group.rg is not in configuration)
  - resource "azurerm_resource_group" "rg" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-rfe-aat" -> null
      - location = "uksouth" -> null
      - name     = "div-rfe-aat" -> null
      - tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-respondent-frontend.git"
          - "application"         = "divorce"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#div-dev"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-05-25T21:13:06Z"
          - "managedBy"           = "Divorce"
        } -> null

      - timeouts {}
    }

  # module.frontend.azurerm_template_deployment.tmprofile[0] will be destroyed
  # (because azurerm_template_deployment.tmprofile is not in configuration)
  - resource "azurerm_template_deployment" "tmprofile" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-rfe-aat/providers/Microsoft.Resources/deployments/div-rfe-aat-tm" -> null
      - name                = "div-rfe-aat-tm" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "additional_host_name" = "respond-divorce.aat.platform.hmcts.net"
          - "is_frontend"          = "1"
          - "name"                 = "div-rfe-aat"
        } -> null
      - resource_group_name = "div-rfe-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - additional_host_name = {
                      - defaultValue = "default"
                      - metadata     = {
                          - description = "An additional hostname this application should be accessible on"
                        }
                      - type         = "string"
                    }
                  - is_frontend          = {
                      - type = "string"
                    }
                  - name                 = {
                      - type = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-05-01"
                      - condition  = "[not(equals(parameters('is_frontend'), '0'))]"
                      - dependsOn  = []
                      - location   = "global"
                      - name       = "[parameters('name')]"
                      - properties = {
                          - dnsConfig            = {
                              - fqdn         = "[concat('hmcts-', parameters('name'),'.trafficmanager.net')]"
                              - relativeName = "[concat('hmcts-', parameters('name'))]"
                              - ttl          = 100
                            }
                          - endpoints            = [
                              - {
                                  - name       = "shutter"
                                  - properties = {
                                      - endpointLocation = "UK South"
                                      - endpointStatus   = "Disabled"
                                      - priority         = 1
                                      - target           = "mojmaintenance.azurewebsites.net"
                                      - weight           = 1
                                    }
                                  - type       = "Microsoft.Network/trafficManagerProfiles/externalEndpoints"
                                },
                              - {
                                  - name       = "app"
                                  - properties = {
                                      - endpointLocation = "UK South"
                                      - endpointStatus   = "Enabled"
                                      - priority         = 2
                                      - target           = "[concat('tm',parameters('additional_host_name'))]"
                                      - weight           = 2
                                    }
                                  - type       = "Microsoft.Network/trafficManagerProfiles/externalEndpoints"
                                },
                            ]
                          - monitorConfig        = {
                              - intervalInSeconds         = 30
                              - path                      = "/health"
                              - port                      = 443
                              - protocol                  = "HTTPS"
                              - timeoutInSeconds          = 10
                              - toleratedNumberOfFailures = 3
                            }
                          - profileStatus        = "Enabled"
                          - trafficRoutingMethod = "Priority"
                        }
                      - tags       = {}
                      - type       = "Microsoft.Network/trafficManagerProfiles"
                    },
                ]
            }
        ) -> null

      - timeouts {}
    }

  # module.frontend.null_resource.azcli_exec[0] will be destroyed
  # (because null_resource.azcli_exec is not in configuration)
  - resource "null_resource" "azcli_exec" {
      - id       = "6657509650400166769" -> null
      - triggers = {
          - "force_run" = "2023-05-25T21:12:58Z"
        } -> null
    }

  # module.redis-cache.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ hostname                      = "div-redis-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat/providers/Microsoft.Cache/Redis/div-redis-aat" -> (known after apply)
        name                          = "div-redis-aat"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ public_network_access_enabled = false -> true
      ~ redis_version                 = "6.0.14" -> "4"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ ssl_port                      = 6380 -> (known after apply)
      + subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat" # forces replacement
      ~ tags                          = {
          ~ "BuiltFrom"           = "https://github.com/HMCTS/div-decree-absolute-frontend.git" -> "https://github.com/HMCTS/div-respondent-frontend.git"
            # (6 unchanged elements hidden)
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (7 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 7500 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (5 unchanged attributes hidden)
        }

      - timeouts {}
    }

  # module.redis-cache.azurerm_resource_group.cache-resourcegroup[0] will be updated in-place
  # (moved from module.redis-cache.azurerm_resource_group.cache-resourcegroup)
  ~ resource "azurerm_resource_group" "cache-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat"
        name     = "div-redis-cache-aat"
      ~ tags     = {
          ~ "BuiltFrom"           = "https://github.com/HMCTS/div-decree-absolute-frontend.git" -> "https://github.com/HMCTS/div-respondent-frontend.git"
            # (6 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 4 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.redis-cache.azurerm_redis_cache.redis has changed
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat/providers/Microsoft.Cache/Redis/div-redis-aat"
        name                          = "div-redis-aat"
      ~ primary_access_key            = (sensitive value)
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/div-respondent-frontend.git"
            "application"         = "divorce"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#div-dev"
            "environment"         = "staging"
            "managedBy"           = "Divorce"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":733,"Program":"tfcmt","SHA1":"","Vars":{}} -->